[
  {
    "title": "SDE - 2 | AI & Mobile Engineer",
    "company": "Fynd (Shopsense Retail Technologies Ltd.)",
    "location": "Bengaluru",
    "range": "Oct 2022 — Present",
    "responsibilities": [
      "Led development of key projects including Metro Wholesale, Tira Beauty, Fynd Store OS, Pixelbin Suite, SwapEasy Diagnostic, and Copilot SDK.",
      "Transitioned from mobile app development (Android, Flutter, React Native) into AI engineering for Fynd Copilot.",
      "Built LLM-powered features: dynamic tool calling, context-aware agents, AI video calls, and ongoing AI voice call SDK with STT/TTS.",
      "Architected frontend automation workflows using Node.js, React, and WebSockets to bridge LLMs with app state.",
      "Implemented production-grade mobile apps with MVVM, Clean Architecture, and multi-module setups.",
      "Collaborated with backend, design, and product teams to ship cross-platform solutions with high reliability.",
      "Mentored junior developers and enforced best practices in architecture, scalability, and performance.",
      "Integrated Firebase (Crashlytics, Analytics, Remote Config), CI/CD pipelines, and socket-based event systems for robust delivery."
    ]
  },
  {
    "title": "SDE 1 Android",
    "company": "Ola Electric",
    "location": "Bengaluru",
    "range": "June 2022 — Sep 2022",
    "responsibilities": [
      "Built features like Party Mode, Proximity Unlock, and Document Upload in the Ola Companion app.",
      "Used Jetpack Compose, BLE, and WorkManager for seamless phone-scooter integration.",
      "Applied MVVM, Clean Architecture, and Koin in a multi-module project setup.",
      "Collaborated with QA and hardware teams to ensure performance and reliability."
    ]
  },
  {
    "title": "Senior Android Developer",
    "company": "Primathon",
    "location": "Gurgaon",
    "range": "Dec 2021 — May 2022",
    "responsibilities": [
      "Led a 3-member Android team to develop the Probo app from scratch using Kotlin and Jetpack Compose.",
      "Designed clean, scalable architecture with real-time socket-based polling logic.",
      "Coordinated with product and backend to deliver high-traffic features with low-latency updates.",
      "Owned releases, QA workflows, and CI/CD."
    ]
  },
  {
    "title": "Android Developer",
    "company": "Applaunch.io",
    "location": "Bengaluru",
    "range": "Nov 2020 — Dec 2021",
    "responsibilities": [
      "Developed the Emma Sleep app for a German client using Dagger 2, BLE, and MVVM.",
      "Handled end-to-end development including API integrations, checkout flows, and logistics.",
      "Worked in Agile sprints and contributed to architectural refactors."
    ]
  },
  {
    "title": "Android Developer",
    "company": "SchoolMitra",
    "location": "Gurgaon",
    "range": "Jan 2019 — Nov 2020",
    "responsibilities": [
      "Independently revamped the SchoolMitra Android app with modern architecture and design principles.",
      "Implemented core modules: student attendance, homework tracking, notifications, and fee updates.",
      "Handled QA, bug fixing, Play Store deployment, and release cycles."
    ]
  }
]